DarrylGamroth/smartstepper/drivers/adc/adc_stm32_injected.c
/*
 * Copyright (c) 2018 Kokoon Technology Limited
 * Copyright (c) 2019 Song Qiang <songqiang1304521@gmail.com>
 * Copyright (c) 2019 Endre Karlson
 * Copyright (c) 2020 Teslabs Engineering S.L.
 * Copyright (c) 2021 Marius Scholtz, RIC Electronics
 * Copyright (c) 2023 Hein Wessels, Nobleo Technology
 * Copyright (c) 2025 Rubus Technologies Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_adc_injected

#include <errno.h>

#include <zephyr/drivers/adc.h>
#include <drivers/adc_injected.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/device.h>
#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <zephyr/toolchain.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_cache.h>
#include <stm32_ll_adc.h>
#include <stm32_ll_system.h>
#if defined(CONFIG_SOC_SERIES_STM32N6X) || defined(CONFIG_SOC_SERIES_STM32U3X) ||                  \
	defined(CONFIG_SOC_SERIES_STM32U5X)
#include <stm32_ll_pwr.h>
#endif /* CONFIG_SOC_SERIES_STM32U5X */

#define LOG_LEVEL CONFIG_ADC_LOG_LEVEL
#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(adc_stm32_injected);

#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/irq.h>

#include <zephyr/linker/linker-defs.h>

/* Here are some redefinitions of ADC versions for better readability */
#if defined(CONFIG_SOC_SERIES_STM32F3X)
#if defined(ADC1_V2_5)
#define STM32F37X_ADC /* F37x */
#elif defined(ADC5_V1_1)
#define STM32F3XX_ADC /* Other F3xx */
#endif                /* ADC5_V1_1 */
#elif defined(CONFIG_SOC_SERIES_STM32H7X)
#if defined(ADC_VER_V5_V90)
#define STM32H72X_ADC /* H72x and H73x */
#elif defined(ADC_VER_V5_X)
#define STM32H74X_ADC /* H74x and H75x */
#elif defined(ADC_VER_V5_3)
#define STM32H7AX_ADC /* H7Ax and H7Bx */
#endif                /* ADC_VER_V5_3 */
#elif defined(CONFIG_SOC_SERIES_STM32L1X) || defined(CONFIG_SOC_SERIES_STM32F2X) ||                \
	defined(CONFIG_SOC_SERIES_STM32F4X) || defined(CONFIG_SOC_SERIES_STM32F7X)
#define STM32F4XX_ADC /* F2, F4, F7, L1 */
#elif defined(CONFIG_SOC_SERIES_STM32F1X) || defined(STM32F37X_ADC)
#define STM32F1XX_ADC /* F1, F37x */
#endif                /* CONFIG_SOC_SERIES_STM32H7X */

/* Clock source values */
#define SYNC  1
#define ASYNC 2

/* Sequencer type */
#define SEQUENCER_FIXED        0
#define SEQUENCER_PROGRAMMABLE 1

/* Internal regulator type */
#define INTERNAL_REGULATOR_NONE              0
#define INTERNAL_REGULATOR_STARTUP_SW_DELAY  1
#define INTERNAL_REGULATOR_STARTUP_HW_STATUS 2

#define ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(value)                                                  \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_STRING_PROP, st_adc_internal_regulator, value,    \
					   INTERNAL_REGULATOR_) 0)

#define ANY_ADC_HAS_DEEP_POWERDOWN                                                                 \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, st_adc_has_deep_powerdown, 0, 1) 0)

#define ANY_ADC_HAS_CHANNEL_PRESELECTION                                                           \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, st_adc_has_channel_preselection, 0, 1) 0)

#define ANY_ADC_HAS_DIFFERENTIAL_SUPPORT                                                           \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, st_adc_has_differential_support, 0, 1) 0)

#define ANY_NUM_COMMON_SAMPLING_TIME_CHANNELS_IS(value)                                            \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, num_sampling_time_common_channels, 0,    \
					   value) 0)

#define ANY_CHILD_NODE_IS_DIFFERENTIAL(inst)                                                       \
	(DT_INST_FOREACH_CHILD_VARGS(inst, IS_EQ_NODE_PROP_OR, zephyr_differential, 0, 1) 0)

#define IS_EQ_PROP_OR(inst, prop, default_value, compare_value)                                    \
	IS_EQ(DT_INST_PROP_OR(inst, prop, default_value), compare_value) ||

#define IS_EQ_NODE_PROP_OR(node, prop, default_value, compare_value)                               \
	IS_EQ(DT_PROP_OR(node, prop, default_value), compare_value) ||

#define IS_EQ_STRING_PROP(inst, prop, compare_value, prefix)                                       \
	IS_EQ(CONCAT(prefix, DT_INST_STRING_UPPER_TOKEN(inst, prop)), compare_value) ||

/* Number of different sampling time values */
#define STM32_NB_SAMPLING_TIME 8

/* Max number of injected channels  */
#define STM32_NB_INJECTED_CHANNELS 4

/* This macro, coupled with listify, creates an array containing values LL_ADC_INJ_RANK_x,
 * where x ranges from 1 to STM32_NB_INJECTED_CHANNELS
 */
#define INJ_RANK(i, _) CONCAT(LL_ADC_INJ_RANK_, UTIL_INC(i))
static const uint32_t table_inj_rank[] = {LISTIFY(STM32_NB_INJECTED_CHANNELS, INJ_RANK, (,)) };

/* This macro, coupled with listify, creates an array containing values
 * LL_ADC_INJ_SEQ_SCAN_ENABLE_x_RANKS, where x ranges from 2 to STM32_NB_INJECTED_CHANNELS
 */
#define INJ_SEQ_LEN(i, _) CONCAT(LL_ADC_INJ_SEQ_SCAN_ENABLE_, UTIL_INC(UTIL_INC(i)), RANKS)
/* Length of this array signifies the maximum sequence length */
static const uint32_t table_inj_seq_len[] = {
	LL_ADC_INJ_SEQ_SCAN_DISABLE,
	LISTIFY(UTIL_DEC(STM32_NB_INJECTED_CHANNELS), INJ_SEQ_LEN, (,)) };

struct adc_stm32_data {
	const struct device *dev;
	adc_injected_callback_t callback;
	void *user_data;
	adc_injected_error_callback_t error_callback;
	void *error_user_data;
	q31_t inj_values[STM32_NB_INJECTED_CHANNELS];
	uint8_t resolution;
	int8_t acq_time_index[2];
	bool enabled;
};

struct adc_stm32_cfg {
	ADC_TypeDef *base;
	void (*irq_cfg_func)(void);
	const struct stm32_pclken pclken;
	const struct stm32_pclken pclken_ker;
	const struct stm32_pclken pclken_pre;
	uint32_t clk_prescaler;
	const struct pinctrl_dev_config *pcfg;
	const uint8_t *table_raw_resolution;
	const uint32_t *table_ll_resolution;
	const uint16_t sampling_time_table[STM32_NB_SAMPLING_TIME];
	int8_t table_resolution_size;
	int8_t num_sampling_time_common_channels;
	int8_t sequencer_type;
	int8_t internal_regulator;
	bool has_pclken_ker: 1;
	bool has_pclken_pre: 1;
	bool has_deep_powerdown: 1;
	bool has_channel_preselection: 1;
	bool has_differential_support: 1;
	bool differential_channels_used: 1;
	uint8_t num_channels;
	uint32_t channel_ids[STM32_NB_INJECTED_CHANNELS];
	uint32_t channel_acq_times[STM32_NB_INJECTED_CHANNELS];
	bool channel_differential[STM32_NB_INJECTED_CHANNELS];
	uint32_t trigger_source;
	uint32_t trigger_edge;
	uint8_t resolution_bits;
};

