DarrylGamroth/smartstepper/drivers/adc/adc_stm32_injected.c
	/* Enable ADC clock source if applicable */
	if (config->has_pclken_ker &&
	    clock_control_configure(clk, (clock_control_subsys_t)&config->pclken_ker, NULL) != 0) {
		return -EIO;
	}

	/* Configure ADC prescaler (at RCC level) if applicable */
	if (config->has_pclken_pre &&
	    clock_control_configure(clk, (clock_control_subsys_t)&config->pclken_pre, NULL) != 0) {
		return -EIO;
	}

#if DT_ANY_INST_HAS_PROP_STATUS_OKAY(st_adc_clock_source)
#if defined(CONFIG_SOC_SERIES_STM32F0X)
	LL_ADC_SetClock(adc, config->clk_prescaler);
#elif defined(ADC_STM32_HAS_INDIVIDUAL_CLOCKS)
	if (adc_stm32_is_clk_sync(config)) {
		LL_ADC_SetClock(adc, config->clk_prescaler);
	} else {
		LL_ADC_SetCommonClock(__LL_ADC_COMMON_INSTANCE(adc), config->clk_prescaler);
		LL_ADC_SetClock(adc, LL_ADC_CLOCK_ASYNC);
	}
#else
	LL_ADC_SetCommonClock(__LL_ADC_COMMON_INSTANCE(adc), config->clk_prescaler);

#ifdef CONFIG_SOC_SERIES_STM32H7X
	/* Set boost according to input frequency */
	ret = adc_stm32h7_setup_boost(config, adc, clk);
#endif
#endif
#endif /* DT_ANY_INST_HAS_PROP_STATUS_OKAY(st_adc_clock_source) */

	return ret;
}

static void adc_stm32_enable_analog_supply(void)
{
#if defined(CONFIG_SOC_SERIES_STM32N6X)
	LL_PWR_EnableVddADC();
#elif defined(CONFIG_SOC_SERIES_STM32U5X) || defined(CONFIG_SOC_SERIES_STM32U3X)
	LL_PWR_EnableVDDA();
#endif /* CONFIG_SOC_SERIES_STM32U5X */
}

static int adc_stm32_init(const struct device *dev)
{
	struct adc_stm32_data *data = dev->data;
	const struct adc_stm32_cfg *config = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	__maybe_unused ADC_TypeDef *adc = config->base;
	int err;

	LOG_DBG("Initializing %s", dev->name);

	if (!device_is_ready(clk)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	data->dev = dev;
	data->enabled = false;

	/* Initialize acquisition time tracking */
	data->acq_time_index[0] = -1;
	data->acq_time_index[1] = -1;

	/*
	 * For series that use common channels for sampling time, all
	 * conversion time for all channels on one ADC instance has to
	 * be the same.
	 * For series that use two common channels, there can be up to two
	 * conversion times selected for all channels in a sequence.
	 * This additional table is for checking that the conversion time
	 * selection of all channels respects these requirements.
	 */

	adc_stm32_set_clock(dev);

	/* Configure ADC inputs as specified in Device Tree, if any */
	err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if ((err < 0) && (err != -ENOENT)) {
		/*
		 * If the ADC is used only with internal channels, then no pinctrl is
		 * provided in Device Tree, and pinctrl_apply_state returns -ENOENT,
		 * but this should not be treated as an error.
		 */
		LOG_ERR("ADC pinctrl setup failed (%d)", err);
		return err;
	}

	adc_stm32_enable_analog_supply();

#if ANY_ADC_HAS_DEEP_POWERDOWN
	if (config->has_deep_powerdown) {
		LL_ADC_DisableDeepPowerDown(adc);
	}
#endif

#if ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(INTERNAL_REGULATOR_STARTUP_SW_DELAY) ||                     \
	ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(INTERNAL_REGULATOR_STARTUP_HW_STATUS)
	/*
	 * Many ADC modules need some time to be stabilized before performing
	 * any enable or calibration actions.
	 */
	if (config->internal_regulator != INTERNAL_REGULATOR_NONE) {
		LL_ADC_EnableInternalRegulator(adc);
	}

	/* Wait for Internal regulator stabilisation
	 * Some series have a dedicated status bit, others rely on a delay
	 */
#if ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(INTERNAL_REGULATOR_STARTUP_SW_DELAY)
	if (config->internal_regulator == INTERNAL_REGULATOR_STARTUP_SW_DELAY) {
		k_busy_wait(LL_ADC_DELAY_INTERNAL_REGUL_STAB_US);
	}
#endif /* ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(INTERNAL_REGULATOR_STARTUP_SW_DELAY) */
#if ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(INTERNAL_REGULATOR_STARTUP_HW_STATUS)
	if (config->internal_regulator == INTERNAL_REGULATOR_STARTUP_HW_STATUS) {
		while (LL_ADC_IsActiveFlag_LDORDY(adc) == 0) {
		}
	}
#endif /* ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(INTERNAL_REGULATOR_STARTUP_HW_STATUS) */

#endif /* INTERNAL_REGULATOR_STARTUP_SW_DELAY || INTERNAL_REGULATOR_STARTUP_HW_STATUS */

	if (config->irq_cfg_func) {
		config->irq_cfg_func();
	}

#if defined(HAS_CALIBRATION)
	adc_stm32_calibrate(dev, false);
#endif /* HAS_CALIBRATION */

	/* Set resolution from DT property or use first from resolutions table */
	if (config->table_resolution_size > 0) {
		uint8_t resolution = config->resolution_bits;
		if (resolution == 0U) {
			resolution = config->table_raw_resolution[0];
		}

		err = set_resolution(dev, resolution);
		if (err < 0) {
			LOG_ERR("Failed to set ADC resolution: %d", err);
			return err;
		}

		/* Store the resolution value for ISR calculations */
		data->resolution = resolution;
	} else {
		/* Fallback to 12-bit if not specified */
		data->resolution = 12;
	}

	/* Configure injected channels if available (must be done BEFORE enabling ADC) */
	if (config->num_channels > 0) {
		/* Ensure ADC is disabled for configuration (required for differential mode) */
		adc_stm32_disable(adc, false);

		/* Configure injected channels */
		err = adc_stm32_configure_injected_channels(dev);
		if (err < 0) {
			LOG_ERR("Failed to configure injected channels: %d", err);
			return err;
		}

		/* Configure injected trigger */
		err = adc_stm32_configure_injected_trigger(dev);
		if (err < 0) {
			LOG_ERR("Failed to configure injected trigger: %d", err);
			return err;
		}

		/* Re-enable ADC after configuration */
		err = adc_stm32_enable(adc);
		if (err < 0) {
			LOG_ERR("Failed to enable ADC after injected config: %d", err);
			return err;
		}
	}

	/* Keep init deterministic: enable happens via adc_injected_enable(). */
	err = adc_stm32_disable(adc, true);
	if (err < 0) {
		return err;
	}

	return 0;
}

/*
 * Injected ADC API implementation
 */

static int adc_stm32_set_callback(const struct device *dev, adc_injected_callback_t callback,
				  void *user_data)
{
	const struct adc_stm32_cfg *config = dev->config;
	ADC_TypeDef *adc = config->base;
	struct adc_stm32_data *data = dev->data;
	bool restore_jeos_irq = data->enabled;

	/* Prevent JEOS ISR from observing partially updated callback state. */
	if (restore_jeos_irq) {
		LL_ADC_DisableIT_JEOS(adc);
	}

