DarrylGamroth/smartstepper/drivers/adc/adc_stm32_injected.c
	if (callback == NULL) {
		data->callback = NULL;
		__DMB();
		data->user_data = user_data;
	} else {
		data->user_data = user_data;
		__DMB();
		data->callback = callback;
	}

	if (restore_jeos_irq) {
		LL_ADC_EnableIT_JEOS(adc);
	}

	return 0;
}

static int adc_stm32_set_error_callback(const struct device *dev,
					adc_injected_error_callback_t callback, void *user_data)
{
	const struct adc_stm32_cfg *config = dev->config;
	ADC_TypeDef *adc = config->base;
	struct adc_stm32_data *data = dev->data;
	bool restore_jeos_irq = data->enabled;

	if (restore_jeos_irq) {
		LL_ADC_DisableIT_JEOS(adc);
	}

	if (callback == NULL) {
		data->error_callback = NULL;
		__DMB();
		data->error_user_data = user_data;
	} else {
		data->error_user_data = user_data;
		__DMB();
		data->error_callback = callback;
	}

	if (restore_jeos_irq) {
		LL_ADC_EnableIT_JEOS(adc);
	}

	return 0;
}

static int adc_stm32_inj_enable(const struct device *dev)
{
	const struct adc_stm32_cfg *config = dev->config;
	struct adc_stm32_data *data = dev->data;
	ADC_TypeDef *adc = config->base;
	int err;

	if (config->num_channels == 0U || config->num_channels > STM32_NB_INJECTED_CHANNELS) {
		LOG_ERR("Invalid injected channel count: %u", config->num_channels);
		return -EINVAL;
	}

	/* Enable ADC if not already enabled */
	err = adc_stm32_enable(adc);
	if (err < 0) {
		return err;
	}

#if defined(LL_ADC_FLAG_JQOVF)
	LL_ADC_ClearFlag_JQOVF(adc);
#endif
#if defined(LL_ADC_FLAG_OVR)
	LL_ADC_ClearFlag_OVR(adc);
#endif
	LL_ADC_ClearFlag_JEOS(adc);

	/* Enable JEOS (end of injected sequence) interrupt */
	LL_ADC_EnableIT_JEOS(adc);
	data->enabled = true;

	/* Start injected conversions (external trigger starts them) */
#if defined(STM32F1XX_ADC) || defined(STM32F4XX_ADC)
	/* F1/F4 use ExtTrig API and configure edge at start time */
	LL_ADC_INJ_StartConversionExtTrig(adc, config->trigger_edge);
#else
	/* Newer families configure edge separately and just start */
	LL_ADC_INJ_StartConversion(adc);
#endif

	return 0;
}

static int adc_stm32_inj_disable(const struct device *dev)
{
	const struct adc_stm32_cfg *config = dev->config;
	struct adc_stm32_data *data = dev->data;
	ADC_TypeDef *adc = config->base;

	/* Disable JEOS interrupt */
	LL_ADC_DisableIT_JEOS(adc);
	data->enabled = false;

	/* Stop injected conversions */
#if !defined(STM32F1XX_ADC) && !defined(STM32F4XX_ADC)
	LL_ADC_INJ_StopConversion(adc);
#endif

	return 0;
}

/*
 * Configure injected channels from devicetree
 * This must be called during init while ADC is disabled
 */
static int adc_stm32_configure_injected_channels(const struct device *dev)
{
	const struct adc_stm32_cfg *config = dev->config;
	ADC_TypeDef *adc = config->base;
	int err;

	/* Per RM0433: Queue mode (JQDIS) must be set while ADEN=0 */
	/* We disabled ADC before calling this function */
	// LL_ADC_INJ_SetQueueMode(adc, LL_ADC_INJ_QUEUE_DISABLE);

	/* Configure JSQR register: sequence length first */
	LL_ADC_INJ_SetSequencerLength(adc, table_inj_seq_len[config->num_channels - 1]);

	/* Configure each injected channel */
	for (uint8_t i = 0; i < config->num_channels; i++) {
		uint32_t channel = __LL_ADC_DECIMAL_NB_TO_CHANNEL(config->channel_ids[i]);

#if ANY_ADC_HAS_CHANNEL_PRESELECTION
		if (config->has_channel_preselection) {
			/*
			 * Each channel in the sequence must be previously enabled in PCSEL.
			 * This register controls the analog switch integrated in the IO level.
			 */
			LL_ADC_SetChannelPreselection(adc, channel);
		}
#endif /* ANY_ADC_HAS_CHANNEL_PRESELECTION */

		/* Set channel sampling time using common logic */
		err = adc_stm32_sampling_time_setup(dev, config->channel_ids[i],
						    config->channel_acq_times[i]);
		if (err < 0) {
			LOG_ERR("Failed to set sampling time for channel %d: %d", i, err);
			return err;
		}

		/* Configure differential mode if needed */
		if (config->channel_differential[i] && !config->has_differential_support) {
			LOG_ERR("Differential mode not supported on channel %u", config->channel_ids[i]);
			return -EINVAL;
		}
#if ANY_ADC_HAS_DIFFERENTIAL_SUPPORT
		if (config->has_differential_support) {
			LL_ADC_SetChannelSingleDiff(adc, channel,
						    config->channel_differential[i] ?
							    LL_ADC_DIFFERENTIAL_ENDED :
							    LL_ADC_SINGLE_ENDED);
		}
#endif

		/* Set the channel rank in injected sequence */
		LL_ADC_INJ_SetSequencerRanks(adc, table_inj_rank[i], channel);
	}

#if defined(STM32F1XX_ADC) || defined(STM32F4XX_ADC)
	LL_ADC_SetSequencersScanMode(adc, LL_ADC_SEQ_SCAN_ENABLE);
#endif /* STM32F1XX_ADC || STM32F4XX_ADC */	

	return 0;
}

/*
 * Configure injected sequence trigger from devicetree
 */
static int adc_stm32_configure_injected_trigger(const struct device *dev)
{
	const struct adc_stm32_cfg *config = dev->config;
	ADC_TypeDef *adc = config->base;

	/* Configure external trigger source */
	LL_ADC_INJ_SetTriggerSource(adc, config->trigger_source);

	/* Configure trigger edge - newer families only */
#if !defined(STM32F1XX_ADC) && !defined(STM32F4XX_ADC)
	LL_ADC_INJ_SetTriggerEdge(adc, config->trigger_edge);
#endif

	LL_ADC_INJ_SetTrigAuto(adc, LL_ADC_INJ_TRIG_INDEPENDENT);

	/* Ensure discontinuous mode is disabled for injected channels */
	/* We want all channels converted on each trigger, not one-by-one */
	LL_ADC_INJ_SetSequencerDiscont(adc, LL_ADC_INJ_SEQ_DISCONT_DISABLE);

	return 0;
}

/*
 * Sampling time setup - copied from upstream adc_stm32.c for consistency
 * Handles different num_sampling_time_common_channels configurations
 */
static int adc_stm32_sampling_time_check(const struct device *dev, uint16_t acq_time)
{
	const struct adc_stm32_cfg *config = (const struct adc_stm32_cfg *)dev->config;

	if (acq_time == ADC_ACQ_TIME_DEFAULT) {
		return 0;
	}

	if (acq_time == ADC_ACQ_TIME_MAX) {
		return STM32_NB_SAMPLING_TIME - 1;
	}

	if (ADC_ACQ_TIME_UNIT(acq_time) != ADC_ACQ_TIME_TICKS) {
		LOG_ERR("Acquisition time expected in ticks only");
		return -EINVAL;
	}

	for (int i = 0; i < STM32_NB_SAMPLING_TIME; i++) {
		if (acq_time == ADC_ACQ_TIME(ADC_ACQ_TIME_TICKS, config->sampling_time_table[i])) {
			return i;
		}
	}

	LOG_ERR("Sampling time value not supported.");
	return -EINVAL;
}

