DarrylGamroth/smartstepper/drivers/adc/adc_stm32_injected.c
/*
 * Provides code for calling adc_stm32_isr for an instance if its IRQn
 * matches:
 *
 * if (irqn == device_irqn(index)):
 *     return "adc_stm32_isr(DEVICE_DT_INST_GET(index));"
 */
#define HANDLE_IRQS(index, irqn)                                                                   \
	COND_CODE_1(IS_EQ(irqn, DT_INST_IRQN(index)), (adc_stm32_isr(DEVICE_DT_INST_GET(index));), \
		    (EMPTY))

/*
 * Name of the common ISR for a given IRQn (taken from a device with a
 * given index). Example, for an ADC instance with IRQn 18, returns
 * "adc_stm32_isr_18".
 */
#define ISR_FUNC(index) UTIL_CAT(adc_stm32_isr_, DT_INST_IRQN(index))

/*
 * Macro for generating code for the common ISRs (by looping of all
 * ADC instances that share the same IRQn as that of the given device
 * by index) and the function for setting up the ISR.
 */

static inline bool adc_stm32_inj_check_and_clear_overrun(ADC_TypeDef *adc)
{
#if defined(LL_ADC_FLAG_JQOVF)
	if (LL_ADC_IsActiveFlag_JQOVF(adc)) {
		LL_ADC_ClearFlag_JQOVF(adc);
		return true;
	}
#endif
#if defined(LL_ADC_FLAG_OVR)
	if (LL_ADC_IsActiveFlag_OVR(adc)) {
		LL_ADC_ClearFlag_OVR(adc);
		return true;
	}
#endif
	return false;
}

/* Debug helper function to process ADC conversions */
static inline void adc_stm32_process_injected_conversions(const struct device *dev,
							   ADC_TypeDef *adc,
							   struct adc_stm32_data *data,
							   const struct adc_stm32_cfg *config)
{
	adc_injected_callback_t callback = data->callback;
	void *user_data = data->user_data;
	uint32_t num_channels = config->num_channels;

	/* Read all injected conversions in rank order and convert to Q31 */
	for (uint32_t i = 0; i < num_channels; i++) {
		uint32_t raw_value = LL_ADC_INJ_ReadConversionData32(adc, table_inj_rank[i]);
		data->inj_values[i] = (q31_t)(raw_value << (31 - data->resolution));
	}

	/* Clear JEOS flag */
	LL_ADC_ClearFlag_JEOS(adc);

	/* Call user callback if registered */
	if (callback != NULL) {
		callback(dev, (const q31_t *)data->inj_values, num_channels, user_data);
	}
}

#define GENERATE_ISR_CODE(index)                                                                   \
	ISR_DIRECT_DECLARE(ISR_FUNC(index))                                                        \
	{                                                                                          \
		const struct device *dev = DEVICE_DT_INST_GET(index);                              \
		const struct adc_stm32_cfg *config = dev->config;                                  \
		struct adc_stm32_data *data = dev->data;                                           \
		ADC_TypeDef *adc = config->base;                                                   \
		adc_injected_error_callback_t err_cb;                                              \
		void *err_user_data;                                                               \
                                                                                                   \
		/* Check for overrun error first */                                                \
		if (adc_stm32_inj_check_and_clear_overrun(adc)) {                                 \
			err_cb = data->error_callback;                                             \
			err_user_data = data->error_user_data;                                     \
			if (err_cb != NULL) {                                                      \
				err_cb(dev, ADC_INJ_ERROR_OVERRUN, err_user_data);                 \
			}                                                                          \
			return 0;                                                                  \
		}                                                                                  \
                                                                                                   \
		/* Check JEOS flag */                                                              \
		if (LL_ADC_IsActiveFlag_JEOS(adc)) {                                               \
			adc_stm32_process_injected_conversions(dev, adc, data, config);            \
		}                                                                                  \
                                                                                                   \
		return 0;                                                                          \
	}                                                                                          \
                                                                                                   \
	static void UTIL_CAT(ISR_FUNC(index), _init)(void)                                         \
	{                                                                                          \
		IRQ_DIRECT_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority),              \
				   ISR_FUNC(index), IRQ_ZERO_LATENCY);                             \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

/*
 * Limit generating code to only the "first" instance:
 *
 * if (first_with_irqn(index) == index):
 *     generate_isr_code(index)
 */
#define GENERATE_ISR(index)                                                                        \
	COND_CODE_1(IS_EQ(index, FIRST_WITH_IRQN(index)), (GENERATE_ISR_CODE(index)), (EMPTY))

DT_INST_FOREACH_STATUS_OKAY(GENERATE_ISR)

/* Only "first" instances need to call the ISR setup function */
#define ADC_STM32_IRQ_FUNC(index)                                                                  \
	.irq_cfg_func = COND_CODE_1(IS_EQ(index, FIRST_WITH_IRQN(index)),                          \
				    (UTIL_CAT(ISR_FUNC(index), _init)), (NULL)),

/*
 * Injected ADC trigger source and edge mapping
 *
 * Devicetree strings are converted to LL driver constants using DT_STRING_UPPER_TOKEN.
 * This approach works with any trigger source supported by the specific STM32 series.
 *
 * Examples:
 *   DT: st,adc-trigger-source = "TIM1_CH4"  -> LL_ADC_INJ_TRIG_EXT_TIM1_CH4
 *   DT: st,adc-trigger-source = "TIM3_TRGO" -> LL_ADC_INJ_TRIG_EXT_TIM3_TRGO
 *   DT: st,adc-trigger-edge = "rising"      -> LL_ADC_INJ_TRIG_EXT_RISING
 */

/* Get trigger source from DT - converts string to LL constant */
#define ADC_INJ_DT_TRIGGER_SRC(idx)                                                                \
	UTIL_CAT(LL_ADC_INJ_TRIG_EXT_, DT_INST_STRING_UPPER_TOKEN(idx, st_adc_trigger_source))

/* Get trigger edge from DT (with default) - converts string to LL constant */
#define ADC_INJ_DT_TRIGGER_EDGE(idx)                                                               \
	UTIL_CAT(LL_ADC_INJ_TRIG_EXT_,                                                             \
		 DT_INST_STRING_UPPER_TOKEN_OR(idx, st_adc_trigger_edge, RISING))

