DarrylGamroth/smartstepper/drivers/adc/adc_stm32_injected.c
/*
 * Injected channel configuration from devicetree
 *
 * These macros parse the child channel nodes and build the injected config structure.
 * Each channel child node has: reg (channel number), zephyr,acquisition-time, etc.
 */

/* Count child channel nodes - for injected ADC, we expect 1-4 channels */
#define ADC_INJ_NUM_CHANNELS(inst) DT_INST_CHILD_NUM_STATUS_OKAY(inst)

/* Helper to get channel ID from child node */
#define ADC_INJ_CHANNEL_ID(node_id) DT_REG_ADDR(node_id)

/* Helper to get acquisition time from child node (with default) */
#define ADC_INJ_CHANNEL_ACQ_TIME(node_id)                                                          \
	COND_CODE_1(DT_NODE_HAS_PROP(node_id, zephyr_acquisition_time), \
		(DT_PROP(node_id, zephyr_acquisition_time)), \
		(0))

/* Helper to check if channel is differential */
#define ADC_INJ_CHANNEL_IS_DIFF(node_id) DT_PROP_OR(node_id, differential, 0)

/* Macros to populate channel arrays element-by-element */
/* These will be called for each child node during DT_INST_FOREACH_CHILD */

/* Macro to initialize one channel entry - called for each child */
#define ADC_INJ_INIT_CHANNEL_ID(child) ADC_INJ_CHANNEL_ID(child)

#define ADC_INJ_INIT_CHANNEL_ACQ(child) ADC_INJ_CHANNEL_ACQ_TIME(child)

#define ADC_INJ_INIT_CHANNEL_DIFF(child) ADC_INJ_CHANNEL_IS_DIFF(child)

/* Build the injected config structure if we have trigger source defined */
#define ADC_INJ_HAS_CONFIG(inst) DT_INST_NODE_HAS_PROP(inst, st_adc_trigger_source)

#define LIST_RESOLUTION(i, index)                                                                \
	CONCAT(LL_ADC_RESOLUTION_, DT_INST_PROP_BY_IDX(index, st_adc_resolutions, i), B)

#define ADC_STM32_INIT(index)                                                                      \
                                                                                                   \
	ADC_STM32_CHECK_DT_CLOCK(index);                                                           \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	BUILD_ASSERT(DT_INST_CHILD_NUM_STATUS_OKAY(index) <= STM32_NB_INJECTED_CHANNELS,         \
		     "Injected ADC supports at most 4 channels");                               \
                                                                                                   \
	static const uint8_t table_raw_resolution##index[] =		\
		DT_INST_PROP(index, st_adc_resolutions);			\
                                                                                                   \
	static const uint32_t table_ll_resolution##index[] = {		\
		LISTIFY(DT_INST_PROP_LEN(index, st_adc_resolutions),		\
			LIST_RESOLUTION, (,), index),				\
	};								\
                                                                                                   \
	static const struct adc_stm32_cfg adc_stm32_cfg_##index = {		\
	.base = (ADC_TypeDef *)DT_INST_REG_ADDR(index),			\
	ADC_STM32_IRQ_FUNC(index)					\
	.pclken = {.bus = DT_INST_CLOCKS_CELL_BY_NAME(index, adcx, bus),			\
		   .enr = DT_INST_CLOCKS_CELL_BY_NAME(index, adcx, bits)},			\
	IF_ENABLED(DT_INST_CLOCKS_HAS_NAME(index, adc_ker),					\
		   (.pclken_ker = {.bus = DT_INST_CLOCKS_CELL_BY_NAME(index, adc_ker, bus), \
				   .enr = DT_INST_CLOCKS_CELL_BY_NAME(index, adc_ker, bits)}, \
		    .has_pclken_ker = true,))							\
	IF_ENABLED(DT_INST_CLOCKS_HAS_NAME(index, adc_pre),					\
		   (.pclken_pre = {.bus = DT_INST_CLOCKS_CELL_BY_NAME(index, adc_pre, bus), \
				   .enr = DT_INST_CLOCKS_CELL_BY_NAME(index, adc_pre, bits)}, \
		    .has_pclken_pre = true,))							\
	.clk_prescaler = ADC_STM32_DT_PRESC(index),			\
	.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),			\
	.differential_channels_used = (ANY_CHILD_NODE_IS_DIFFERENTIAL(index) > 0), \
	.sequencer_type = CONCAT(SEQUENCER_,							\
		DT_INST_STRING_UPPER_TOKEN(index, st_adc_sequencer)),				\
	.internal_regulator = CONCAT(INTERNAL_REGULATOR_,					\
		DT_INST_STRING_UPPER_TOKEN(index, st_adc_internal_regulator)),			\
	.has_deep_powerdown = DT_INST_PROP(index, st_adc_has_deep_powerdown),			\
	.has_channel_preselection = DT_INST_PROP(index, st_adc_has_channel_preselection),	\
	.has_differential_support = DT_INST_PROP(index, st_adc_has_differential_support),	\
	.sampling_time_table = DT_INST_PROP(index, sampling_times),	\
	.num_sampling_time_common_channels =				\
		DT_INST_PROP_OR(index, num_sampling_time_common_channels, 0),\
	IF_ENABLED(ADC_INJ_HAS_CONFIG(index),				\
			   (.num_channels = DT_INST_CHILD_NUM_STATUS_OKAY(index), \
			    .channel_ids = {					\
				DT_INST_FOREACH_CHILD_STATUS_OKAY_SEP(index,	\
				ADC_INJ_INIT_CHANNEL_ID, (,))		\
		    },							\
		    .channel_acq_times = {				\
			DT_INST_FOREACH_CHILD_STATUS_OKAY_SEP(index,	\
				ADC_INJ_INIT_CHANNEL_ACQ, (,))		\
		    },							\
		    .channel_differential = {				\
			DT_INST_FOREACH_CHILD_STATUS_OKAY_SEP(index,	\
				ADC_INJ_INIT_CHANNEL_DIFF, (,))		\
		    },							\
			    .trigger_source = ADC_INJ_DT_TRIGGER_SRC(index),	\
			    .trigger_edge = ADC_INJ_DT_TRIGGER_EDGE(index),))	\
	.table_resolution_size = DT_INST_PROP_LEN(index, st_adc_resolutions),	\
	.table_raw_resolution = table_raw_resolution##index,		\
	.table_ll_resolution = table_ll_resolution##index,		\
	.resolution_bits = DT_INST_PROP_OR(index, resolution, 0),	\
	};                             \
                                                                                                   \
	static struct adc_stm32_data adc_stm32_data_##index = {};                                  \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(index, adc_stm32_init, NULL,                                         \
			      &adc_stm32_data_##index, &adc_stm32_cfg_##index, POST_KERNEL,        \
			      CONFIG_ADC_INIT_PRIORITY, &api_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(ADC_STM32_INIT)
